//
// Created by lak19 on 2025/7/14.
//

#include "../Inc/uart_command.h"
uint8_t DataBuff[128];
uint8_t dataArr[128] = {0}; // 假设最大数据长度为128
/*************************帧格式************************
 * 帧头  | 数据长度 | 数据内容 | 校验和 |
 * 0xAA |   N      |   Data   |  Sum   |
 * N = 数据长度
 * (帧头和校验和)
 * 校验和为除去校验和的所有字节之和
 * 注意：数据内容的长度不能超过125字节
 ****************************************************/

/********************命令格式********************
 * P2=1.23!  // 设置电机速度环PID参数
 * I2=0.01!
 * D2=0.001!
 * P1=0.5!   // 设置电机位置环PID参数
 * I1=0.01!
 * D1=0.001!
 * Pos=10000! // 设置电机目标位置
 * Spe=5!     // 设左电机目标速度
 * F=6!      // 设置前进速度，可以为负数
 * L=3!      // 设置左转速度
 * R=3!      // 设置右转速度
 * RES_W     // 设定灰度传感器白色标定值，返回八位数组
 * RES_B     // 设定灰度传感器黑色标定值，返回八位数组
 ****************************************************/


/**
 * 简单的命令解析函数，放在DMA空闲中断回调函数
 * @param huart
 */
void Rx_Command(uint16_t size)
{
    if (DataBuff[0] == 0xAA)
    {
        if (DataBuff[1] == size) {
            uint8_t sum = 0;
            for (int8_t i = 0; i < size - 1; i++)
                sum += DataBuff[i];
            if (sum == DataBuff[size - 1])
                {
                // 校验通过，提取数据
                uint8_t dataLen = size - 3; // 数据从DataBuff[2]开始，最后一位是校验和
                for (uint8_t i = 0; i < dataLen; i++) {
                    dataArr[i] = DataBuff[2 + i];
                }
                // 此处可根据需要处理dataArr
            }
        }
    }
}